src/cf/src/Documents/ОтгрузкаТовара/ОтгрузкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаТовара</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ОтгрузкиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Субподрядчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКредита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/ОтгрузкаТовара/ManagerModule.bsl
#Область Печать

Процедура ПечатьТорг12(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЭтоВозвратПоставщику = ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратПоставщику");
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_РеализацияТоваровУслуг_Торг12";
	ТабФормирование = Новый ТабличныйДокумент;
	ТабФормирование.АвтоМасштаб = Истина;
	ТабФормирование.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	// Макет
	Макет = Документы.РеализацияТоваровУслуг.ПолучитьМакет("РасходнаяНакладная");
	// Переменные
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Грузоотправитель = Док.Контрагент;
		Грузополучатель = Док.Организация; 
		Плательщик = Док.Организация;
		ДокНомер = Док.НомерВходящегоДокумента;
		ДокДата = Док.ДатаВходящегоДокумента;
	Иначе
		Грузоотправитель = Док.Организация;
		Грузополучатель =  Док.Контрагент;
		Плательщик = Док.Контрагент;
		ДокНомер = РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер);
		ДокДата = Док.Дата;
	КонецЕсли;
    КарточкаГрузоотправителя = Справочники.Контрагенты.ПолучитьКарточку(Грузоотправитель, Док.Дата);
	КарточкаГрузополучателя = Справочники.Контрагенты.ПолучитьКарточку(Грузополучатель, Док.Дата);
	КарточкаПлательщика = Справочники.Контрагенты.ПолучитьКарточку(Плательщик, Док.Дата);
	// Шапка
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оЗаголовок = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	оШапка.Параметры.НомерДокумента = ДокНомер;
	оШапка.Параметры.ДатаДокумента = ДокДата;
	оШапка.Параметры.ПредставлениеОрганизации = КарточкаГрузоотправителя.Представление;
	оШапка.Параметры.ПредставлениеПоставщика = КарточкаГрузоотправителя.Представление;
	оШапка.Параметры.ОрганизацияПоОКПО = КарточкаГрузоотправителя.Реквизиты.ОКПО;
	оШапка.Параметры.ПредставлениеГрузополучателя = КарточкаГрузополучателя.Наименование + ", " + КарточкаГрузополучателя.Реквизиты.АдресФактический;
	оШапка.Параметры.АдресДоставки = КарточкаГрузополучателя.Реквизиты.АдресДоставки;
	оШапка.Параметры.ГрузополучательПоОКПО = КарточкаГрузополучателя.Реквизиты.ОКПО;
	оШапка.Параметры.ПредставлениеПлательщика = КарточкаПлательщика.Представление;
	оШапка.Параметры.ПлательщикПоОКПО = КарточкаПлательщика.Реквизиты.ОКПО;
	оШапка.Параметры.Основание = "Договор " + СокрЛП(Док.Договор);
	ТабФормирование.Вывести(оШапка);
	ТабФормирование.Вывести(оЗаголовок);
	// Строки
	оСтрока = Макет.ПолучитьОбласть("Строка");
	оИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	оВсего = Макет.ПолучитьОбласть("Всего");
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	ИтогоМест = 0;
	ИтогоНетто = 0;
	ИтогоБрутто = 0;
	ИтогоСтраницаКоличество = 0;
	ИтогоСтраницаСумма = 0;
	ИтогоСтраницаМест = 0;
	Ном = 1;
	МасВывод = Новый Массив;
	ТЧТовары = СерииИРазмещение.ОбъединитьТоварыССериями(Док);	
	ТЧТовары = ВыводПечатныхФорм.СформироватьТабличныеДанные(ТЧТовары);	
	КоличествоТоваров = ТЧТовары.Количество();
	Для Каждого Стр Из ТЧТовары Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.НомерСтроки = Ном;
		//Если Док.ЦенаВключаетНДС Тогда
			СуммаБезНДС = Стр.СуммаСНДС - Стр.СуммаНДС;
			ЦенаБезНДС = ?(Стр.Количество = 0, 0, СуммаБезНДС / Стр.Количество);
			оСтрока.Параметры.Сумма = СуммаБезНДС;
			оСтрока.Параметры.Цена = ЦенаБезНДС;
		//КонецЕсли;
		МасВывод.Очистить();
		МасВывод.Добавить(оСтрока);
		МасВывод.Добавить(оИтогоПоСтранице);			
		Если Ном = КоличествоТоваров Тогда				
			МасВывод.Добавить(оВсего);
			МасВывод.Добавить(оПодвал);
			Если Не ТабФормирование.ПроверитьВывод(МасВывод) Тогда
				оИтогоПоСтранице.Параметры.ИтогоКоличествоНаСтранице = ИтогоСтраницаКоличество;
				оИтогоПоСтранице.Параметры.ИтогоМестНаСтранице = ИтогоСтраницаМест;
				оИтогоПоСтранице.Параметры.ИтогоСуммаНаСтранице = ИтогоСтраницаСумма;
				ТабФормирование.Вывести(оИтогоПоСтранице);
				ТабФормирование.ВывестиГоризонтальныйРазделительСтраниц();
				ИтогоСтраницаКоличество = 0;
				ИтогоСтраницаСумма = 0;
				ИтогоСтраницаМест = 0;
				ТабФормирование.Вывести(оЗаголовок);
			КонецЕсли;
		ИначеЕсли Не ТабФормирование.ПроверитьВывод(МасВывод) Тогда
			оИтогоПоСтранице.Параметры.ИтогоКоличествоНаСтранице = ИтогоСтраницаКоличество;
			оИтогоПоСтранице.Параметры.ИтогоМестНаСтранице = ИтогоСтраницаМест;
			оИтогоПоСтранице.Параметры.ИтогоСуммаНаСтранице = ИтогоСтраницаСумма;
			ТабФормирование.Вывести(оИтогоПоСтранице);
			ТабФормирование.ВывестиГоризонтальныйРазделительСтраниц();
			ИтогоСтраницаКоличество = 0;
			ИтогоСтраницаСумма = 0;
			ИтогоСтраницаМест = 0;
			ТабФормирование.Вывести(оЗаголовок);
		КонецЕсли;
		ТабФормирование.Вывести(оСтрока);
		ИтогоКоличество = ИтогоКоличество + Стр.Количество;
		ИтогоСумма = ИтогоСумма + Стр.Сумма;
		ИтогоМест = ИтогоМест + Стр.КоличествоУпаковок;
		//ИтогоНетто = ИтогоНетто + Стр.Количество;
		//ИтогоБрутто = ИтогоБрутто + Стр.Количество;
		ИтогоСтраницаКоличество = ИтогоСтраницаКоличество + Стр.Количество;
		ИтогоСтраницаСумма = ИтогоСтраницаСумма + Стр.СуммаСНДС;
		ИтогоСтраницаМест = ИтогоСтраницаМест + Стр.КоличествоУпаковок;
		Ном = Ном + 1;
	КонецЦикла;
	оИтогоПоСтранице.Параметры.ИтогоКоличествоНаСтранице = ИтогоСтраницаКоличество;
	оИтогоПоСтранице.Параметры.ИтогоМестНаСтранице = ИтогоСтраницаМест;
	оИтогоПоСтранице.Параметры.ИтогоСуммаНаСтранице = ИтогоСтраницаСумма;
	ТабФормирование.Вывести(оИтогоПоСтранице);
	// Всего
	оВсего.Параметры.ИтогоКоличество = ИтогоКоличество;
	оВсего.Параметры.ИтогоМест = ИтогоМест;
	оВсего.Параметры.ИтогоСумма = ИтогоСумма;
	ТабФормирование.Вывести(оВсего);
	// Подвал
	оПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоТоваров,,",,,,,,,,0");
	оПодвал.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтогоМест,,",,,,,,,,0");
	оПодвал.Параметры.МассаГрузаНеттоПрописью = ЧислоПрописью(ИтогоНетто,,",,,,,,,,0");
	оПодвал.Параметры.МассаГрузаБруттоПрописью = ЧислоПрописью(ИтогоБрутто,,",,,,,,,,0");
	оПодвал.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(ИтогоСумма, Справочники.Валюты.MoroccanDirham, Перечисления.Локализации.fr_CA);
	
	оПодвал.Параметры.ФИОРуководителя = КарточкаГрузоотправителя.Руководитель.ДляПечатиПолное;		
	оПодвал.Параметры.ДолжностьРуководителя = КарточкаГрузоотправителя.Руководитель.Должность;		
	оПодвал.Параметры.ФИОГлавБухгалтера = КарточкаГрузоотправителя.ГлавныйБухгалтер.Должность; 		
	
	ТабФормирование.Вывести(оПодвал);
	ТабФормирование.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.Вывести(ТабФормирование);
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Товарная накладная");
КонецПроцедуры

Процедура ПечатьСчетНаОплату(Док, Таб, РазбитьНДС = Ложь) Экспорт
	ВыбДата = Док.Дата;
	ВыбНомер = Док.Номер;
	Организация = Док.Организация;
	Контрагент = Док.Контрагент;
	Макет = Документы.РеализацияТоваровУслуг.ПолучитьМакет("Счёт"); 
    КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Организация, Док.Дата);
    КарточкаКонтрагента = Справочники.Контрагенты.ПолучитьКарточку(Контрагент, Док.Дата);
	ОбластьЗаголовокСчета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьЗаголовокСчета.Параметры.БанкПолучателяпредставление = КарточкаОрганизации.БанковскийСчётОсновной.Наименование;
	ОбластьЗаголовокСчета.Параметры.БикБанкаПолучателя = КарточкаОрганизации.БанковскийСчётОсновной.Банк.Код;
	ОбластьЗаголовокСчета.Параметры.СчетБанкаПолучателяПредставление = КарточкаОрганизации.БанковскийСчётОсновной.Банк.КоррСчёт;
	ОбластьЗаголовокСчета.Параметры.СчетПолучателяПредставление = КарточкаОрганизации.БанковскийСчётОсновной.НомерСчёта;
	ОбластьЗаголовокСчета.Параметры.ИННПолучателя = Организация.NIF;
	ОбластьЗаголовокСчета.Параметры.КПППолучателя = КарточкаОрганизации.Реквизиты.ICE;
	ОбластьЗаголовокСчета.Параметры.ПредставлениеПолучателя = Организация.Наименование;
	Таб.Вывести(ОбластьЗаголовокСчета);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Счет на оплату № " + Выбномер + " от " + Формат(ВыбДата, "ДЛФ=DD");
	Таб.Вывести(ОбластьЗаголовок);
	
	ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
	ОбластьПоставщик.Параметры.ПредставлениеПоставщика = Организация.Наименование 
	+ ", IF " + Организация.NIF + ", RC " + Организация.RC + ", " 
	+ КарточкаОрганизации.Реквизиты.АдресЮридический;
	Таб.Вывести(ОбластьПоставщик);
	
	ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель");
	ОбластьПокупатель.Параметры.ПредставлениеПокупателя = Контрагент.Наименование
	+ ", IF " + Контрагент.NIF + ", RC " + Контрагент.RC + ", " 
	+ КарточкаКонтрагента.Реквизиты.АдресЮридический + ", тел.: " + КарточкаКонтрагента.Реквизиты.Телефон;
	Таб.Вывести(ОбластьПокупатель);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Таб.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТЗ = СерииИРазмещение.ОбъединитьТоварыССериями(Док);	
	ТЗ = ВыводПечатныхФорм.СформироватьТабличныеДанные(ТЗ);	

	Ном = 1;
	Для Каждого Стр Из ТЗ цикл
		ОбластьСтрока.Параметры.Заполнить(Стр);
		//ОбластьСтрока.Параметры.Единица = Стр.Единица.Единица;
		ОбластьСтрока.Параметры.НомерСтроки = Ном;
		Таб.Вывести(ОбластьСтрока);
		Ном = Ном + 1;
	КонецЦикла;
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.Всего = ТЗ.Итог("Сумма");
	Таб.Вывести(ОбластьИтого);
	
	оИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	оИтогоНДС.Параметры.НДС = "Сумма НДС";
	оИтогоНДС.Параметры.ВсегоНДС = ТЗ.Итог("СуммаНДС");
	Таб.Вывести(оИтогоНДС);
	
	Если РазбитьНДС тогда
		ТзНДС = ТЗ.Скопировать();
		ТзНДС.Свернуть("СтавкаНДС", "СуммаНДС");
		ТзНДС.Сортировать("СтавкаНДС");
		Для каждого Стр Из ТзНДС цикл
			оИтогоНДС.Параметры.НДС = "В т.ч. "+Стр.СтавкаНДС;
			оИтогоНДС.Параметры.ВсегоНДС = Стр.СуммаНДС;
			Таб.Вывести(оИтогоНДС);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьИтогоКОплате = Макет.ПолучитьОбласть("ИтогоКОплате");
	ОбластьИтогоКОплате.Параметры.ИтогоКОплате = ТЗ.Итог("Сумма");
	Таб.Вывести(ОбластьИтогоКОплате);
	
	ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + ТЗ.Количество() + ", на сумму " + ТЗ.Итог("Сумма") + " руб.";
	ОбластьСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(ТЗ.Итог("Сумма"), Константы.ВалютаРегламентированногоУчета.Получить(), Перечисления.Локализации.fr_CA);
	Таб.Вывести(ОбластьСуммаПрописью);
	
	ОбластьПодвалСчета = макет.ПолучитьОбласть("ПодвалСчета");
	Таб.Вывести(ОбластьПодвалСчета);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь; 
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Процедура ПечатьАктаОбОказанииУслуг(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_РеализацияТоваровУслуг_АктОбОказанииУслуг";
	Макет = ПолучитьОбщийМакет("АктОбОказанииУслуг");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт");
	Таб.Вывести(оЗаголовок);
	оПоставщик = Макет.ПолучитьОбласть("Поставщик");	
	оПоставщик.Параметры.ПредставлениеПоставщика = Док.Организация;
	Таб.Вывести(оПоставщик);
	оПолучатель = Макет.ПолучитьОбласть("Получатель");	
	оПолучатель.Параметры.ПредставлениеПолучателя = Док.Контрагент;
	оПолучатель.Параметры.Основание = Док.Договор;
	Таб.Вывести(оПолучатель);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	ТЗ = Док.ТЧУслуги.Выгрузить();	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока = Макет.ПолучитьОбласть("Строка"); 
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Номенклатура = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Содержание, , Истина);
		оСтрока.Параметры.ЕдиницаИзмерения = Стр.Номенклатура.Единица;
		Таб.Вывести(оСтрока);
	КонецЦикла;
	ОИтого = Макет.ПолучитьОбласть("Итого");
	ОИтого.Параметры.Всего = ТЗ.Итог("Сумма");
	Таб.Вывести(ОИтого);
	оИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	оИтогоНДС.Параметры.НДС = "Сумма НДС";
	оИтогоНДС.Параметры.ВсегоНДС = ТЗ.Итог("СуммаНДС");
	Таб.Вывести(оИтогоНДС);
	ОСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	ОСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + ТЗ.Количество() 
	+ ", на сумму " + ТЗ.Итог("Сумма") + " руб.";
	ОСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(ТЗ.Итог("Сумма"),Константы.ВалютаРегламентированногоУчета.Получить(), Перечисления.Локализации.fr_CA);
	Таб.Вывести(ОСуммаПрописью);
	
	ОПодписи = Макет.ПолучитьОбласть("Подписи");
	ОПодписи.Параметры.НазваниеОрганизации = Док.Организация;
	ОПодписи.Параметры.НазваниеЗаказчика = Док.Контрагент;
	Таб.Вывести(ОПодписи);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт");
КонецПроцедуры

Function PrintFacture(Док, Spreadsheet) Export
	//{{_PRINT_WIZARD(Печать)
	//Template = Documents.FactureSortie.GetTemplate(TemplateName);
	//TableName = Ref.MetaData().Name;
	Template = Документы.РеализацияТоваровУслуг.ПолучитьМакет("FactureOld");
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ
	|	Doc.Контрагент КАК Client,
	|	Doc.Ответственный КАК Createur,
	|	Doc.Дата КАК Date,
	|	Doc.Номер КАК Number,
	|	Doc.Договор.ВалютаВзаиморасчётов КАК Devise,
	|	Doc.Сумма КАК Somme,
	|	Doc.СуммаНДС КАК SommeTVA,
	|	Doc.Ссылка КАК DocRef,
	|	Doc.ТЧТовары.(
	|		КодСтроки КАК LineNumber,
	|		Номенклатура КАК Produit,
	|		Количество КАК Quantite,
	|		Цена КАК Prix,
	|		СтавкаНДС КАК TVA,
	|		СуммаНДС КАК SommeTVA,
	|		СуммаСкидки КАК Remise,
	|		Сумма КАК Somme,
	|		СуммаСНДС КАК SommeTotale
	|	) КАК TabularSection,
	|	Doc.Организация КАК Organisation,
	|	Doc.Основание КАК Основание
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Doc
	|ГДЕ
	|	Doc.Ссылка = &Ref";
	Query.Parameters.Insert("Ref", Док);
	Selection = Query.Execute().Select();

	//AreaCaption = Template.GetArea("Caption");
	Header = Template.GetArea("Header");
	AreaTabularSectionHeader = Template.GetArea("TabularSectionHeader");
	AreaTabularSection = Template.GetArea("TabularSection");
	AreaTabularSectionFooterSousTotal = Template.GetArea("TabularSectionFooterSousTotal");
	AreaTabularSectionFooterRemise = Template.GetArea("TabularSectionFooterRemise");
	AreaTabularSectionFooterTotal = Template.GetArea("TabularSectionFooterTotal"); 
	AreaTabularSectionFooterTotalTaxe = Template.GetArea("TabularSectionFooterTotalTaxe"); 
	//AreaTabularSectionEmpty = Template.GetArea("TabularSectionEmpty");
	//Spreadsheet = New SpreadsheetDocument;
	
	InsertPageBreak = False;
	While Selection.Next() Do
		//If InsertPageBreak Then
		//	Spreadsheet.PutHorizontalPageBreak();
		//EndIf;

		FirstRowNumber = Spreadsheet.TableHeight + 1;
		//StrNumber = 11;
		Header.Parameters.Fill(Selection);
		//Header.Parameters.DetailsParameter = "";
		
		If Selection.Organisation <> Catalogs.Организации.EmptyRef() Then 
			FieldPhoto = Selection.Organisation.Логотип.Get();
			Try
				Header.Drawings[0].Picture = New Picture(FieldPhoto);
			Except
			EndTry;
		EndIf;
		
    	OrganisationCard = Справочники.Контрагенты.ПолучитьКарточку(Selection.Organisation, Док.Дата);
		Organisation = ""+Selection.Organisation.Description+", "+OrganisationCard.АдресЮридический + "
		|Tel: "+OrganisationCard.Телефоны+",  e-mail: "+OrganisationCard.Реквизиты.email;
		
		Banque = ""+OrganisationCard.БанковскийСчётОсновной.Банк+", "+OrganisationCard.БанковскийСчётОсновной.Банк.Адрес + "
		|Numero de compte: "+OrganisationCard.БанковскийСчётОсновной.НомерСчёта;
		
    	ClientCard = Справочники.Контрагенты.ПолучитьКарточку(Selection.Client, Док.Дата);
		Client = ""+Selection.Client.Description+"
		|ICE: "+ClientCard.Реквизиты.ICE;
		
		VT = РегистрыНакопления.ВзаиморасчётыСПокупателями.GetTableOfPayments(Selection.DocRef);
		If VT.Count() = 0 OR VT.Total("Somme") > 0 Then
			PaiementStatus = ВРЕГ("NON PAYéE");
		Else
			PaiementStatus = ВРЕГ("PAYéE");
		EndIf;
		MethodeDePaiement = "Méthode De Paiement: ";
		If VT.Count() = 0 Then
			MethodeDePaiement = MethodeDePaiement + "
			|Virement bancaire";
		Else
			For Each StrVT in VT do
				If Not ValueIsFilled(StrVT.TypesDePayment) then continue; EndIf;
				MethodeDePaiement = MethodeDePaiement + "
				|"+StrVT.TypesDePayment;
			EndDo;
		endif;
		Header.Parameters.PaiementStatus = PaiementStatus;
		Header.Parameters.MethodeDePaiement = MethodeDePaiement;
		
		Header.Parameters.Date = Format(Selection.Date,"DLF = 'DD'; Л = 'en'");
		Header.Parameters.Organisation = Organisation;
		Header.Parameters.Banque = Banque;
		TextBonDeCommande = "";
		BonDeCommande = "";
		//If GetFunctionalOption("FunctionalOptionUtiliserCommandeDuClient") And ValueIsFilled(Selection.CommandeDuClient) Then 
		//	TextBonDeCommande = "Bon de commande: ";
		//	If ValueIsFilled(Selection.CommandeDuClient.NumeroClient) Then 
		//		BonDeCommande = "" + Selection.CommandeDuClient.NumeroClient + " de "+ Format(Selection.CommandeDuClient.DateClient,"DLF = 'DD'; Л = 'en'");
		//	Else
		//		BonDeCommande = "" + Selection.CommandeDuClient.Numero + " de "+ Format(Selection.CommandeDuClient.Date,"DLF = 'DD'; Л = 'en'");
		//	EndIf;
		//EndIf;	
		Header.Parameters.TextBonDeCommande = TextBonDeCommande;
		Header.Parameters.BonDeCommande = BonDeCommande;
		Header.Parameters.Client = Client;
		Spreadsheet.Put(Header, Selection.Level());
		
		TotalRemise = 0;
		TotalSomme = 0;

		//AreaTabularSectionHeader.Parameters.DetailsParameter = "";
		//AreaTabularSectionHeader.Parameters.Devise = Selection.Devise;
		Spreadsheet.Put(AreaTabularSectionHeader);
		SelectionTabularSection = Selection.TabularSection.Select();
		While SelectionTabularSection.Next() Do
			AreaTabularSection.Parameters.Fill(SelectionTabularSection);
			AreaTabularSection.Parameters.Descriptif = SelectionTabularSection.Produit.Наименование;
			AreaTabularSection.Parameters.Prix = SelectionTabularSection.Prix;
			AreaTabularSection.Parameters.TauxTVA = SelectionTabularSection.TVA;
			AreaTabularSection.Parameters.TVA = SelectionTabularSection.SommeTVA;
			//AreaTabularSection.Parameters.DetailsParameter = "";
			Spreadsheet.Put(AreaTabularSection, SelectionTabularSection.Level());
			TotalRemise = TotalRemise + SelectionTabularSection.Remise;
			TotalSomme = TotalSomme + SelectionTabularSection.Somme;
			//StrNumber = StrNumber - 1;
		EndDo;
		
		AreaTabularSectionFooterSousTotal.Parameters.SousTotal = ""+Format(TotalSomme,"NFD=2; NZ=0,00")+" "+Selection.Devise;
		//AreaTabularSectionFooterSousTotal.Parameters.DetailsParameter = "";
		Spreadsheet.Put(AreaTabularSectionFooterSousTotal);
		If TotalRemise <> 0 Then 
			AreaTabularSectionFooterRemise.Parameters.Remise = ""+Format(TotalRemise,"NFD=2; NZ=0,00")+" "+Selection.Devise;
			//AreaTabularSectionFooterRemise.Parameters.DetailsParameter = "";
			Spreadsheet.Put(AreaTabularSectionFooterRemise);
		EndIf;
		
		AreaTabularSectionFooterTotalTaxe.Parameters.TotalTaxe = ""+Format(Selection.SommeTVA,"NFD=2; NZ=0,00")+" "+Selection.Devise;
		//AreaTabularSectionFooterTotalTaxe.Parameters.DetailsParameter = "";
		Spreadsheet.Put(AreaTabularSectionFooterTotalTaxe);
		
		AreaTabularSectionFooterTotal.Parameters.Total = ""+Format(Selection.Somme,"NFD=2; NZ=0,00")+" "+Selection.Devise;
		//AreaTabularSectionFooterTotal.Parameters.DetailsParameter = "Spreadsheet";
		Spreadsheet.Put(AreaTabularSectionFooterTotal);
		//StrNumber = StrNumber - 1;
		
		//If StrNumber > 0 Then
		//	For CurStrNumber = 1 to StrNumber do
		//		Spreadsheet.Put(AreaTabularSectionEmpty);
		//	EndDo;
		//EndIf;
		Capital = ?(ValueIsFilled(OrganisationCard.Реквизиты.УставныйКапитал)," ● Capital " + OrganisationCard.Реквизиты.УставныйКапитал + " dirhams","");
		Footer = ""+Selection.Organisation.Description + Capital + " ● " + OrganisationCard.АдресЮридический;
		FooterAdd = "";
		If ValueIsFilled(OrganisationCard.Реквизиты.RC) Then 
			If FooterAdd <> "" Then 
				FooterAdd = FooterAdd + " ● ";
			EndIf;
			FooterAdd = FooterAdd + "RC " + OrganisationCard.Реквизиты.RC;
		EndIf;
		If ValueIsFilled(OrganisationCard.Реквизиты.TaxeProfessionnelle) Then 
			If FooterAdd <> "" Then 
				FooterAdd = FooterAdd + " ● ";
			EndIf;
			FooterAdd = FooterAdd +  "Patente " + OrganisationCard.Реквизиты.TaxeProfessionnelle;
		EndIf;
		If ValueIsFilled(OrganisationCard.Реквизиты.NIF) Then 
			If FooterAdd <> "" Then 
				FooterAdd = FooterAdd + " ● ";
			EndIf;
			FooterAdd = FooterAdd +  "IF " + OrganisationCard.Реквизиты.NIF;
		EndIf;
		If ValueIsFilled(OrganisationCard.Реквизиты.CNSS) Then 
			If FooterAdd <> "" Then 
				FooterAdd = FooterAdd + " ● ";
			EndIf;
			FooterAdd = FooterAdd +  "CNSS " + OrganisationCard.Реквизиты.CNSS;
		EndIf;
		If ValueIsFilled(OrganisationCard.Реквизиты.ICE) Then 
			If FooterAdd <> "" Then 
				FooterAdd = FooterAdd + " ● ";
			EndIf;
			FooterAdd = FooterAdd +  "ICE " + OrganisationCard.Реквизиты.ICE;
		EndIf;
		If ValueIsFilled(OrganisationCard.Реквизиты.Web) Then 
			If FooterAdd <> "" Then 
				FooterAdd = FooterAdd + " ● ";
			EndIf;
			FooterAdd = FooterAdd +  "Site " + OrganisationCard.Реквизиты.Web;
		EndIf;
		
		If FooterAdd <> "" Then 
			Footer = Footer + "
			|" + FooterAdd;
		EndIf;
		
		Spreadsheet.Footer.StartPage = 1;
		Spreadsheet.Footer.CenterText = Footer;
		Spreadsheet.Footer.Enabled = Истина;
		Spreadsheet.FooterSize = 10;
		
		Spreadsheet.BottomMargin = 20;
		
		//InsertPageBreak = True;
		Spreadsheet.PutHorizontalPageBreak();
		//PrintManagement.SetDocumentPrintArea(Spreadsheet, FirstRowNumber, PrintObjects, Selection.DocRef);
	EndDo; 
	
	Return Spreadsheet;
	
	//}}
EndFunction

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		Если ПараметрыСеанса.ПараметрыКлиентаНаСервере.ЭтоМобильныйКлиент Тогда
			ВыбраннаяФорма = "ФормаДокументаМобильныйКлиент";
		Иначе
			ВыбраннаяФорма = "ФормаДокумента";	
		КонецЕсли;	
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда
		СтандартнаяОбработка = Ложь;
		Если ПараметрыСеанса.ПараметрыКлиентаНаСервере.ЭтоМобильныйКлиент Тогда
			ВыбраннаяФорма = "ФормаСпискаМобильныйКлиент";
		Иначе
			ВыбраннаяФорма = "ФормаСписка";	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
